9/data/attachments/36840009ea79528b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsPageRequest>
            <nif:username>soap_friends_fab22856-611d-4f4b-9475-f7710b7ccd0a</nif:username>
            <nif:pageInfo>
                <nif:page>-1</nif:page>
                <nif:size>1</nif:size>
                
            </nif:pageInfo>
            
        </nif:friendsPageRequest>
    </soapenv:Body>
</soapenv:Envelope>